calcback.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-04 Do 19:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Calcback</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nikolai Weidt" />
</head>
<body>
<div id="content">
<h1 class="title">Calcback</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2700a6f">1. What is this?</a></li>
<li><a href="#org4548a0d">2. Imports:</a></li>
<li><a href="#orge2fe338">3. Defining some variables:</a></li>
<li><a href="#orgc0fff37">4. Read .csv-file:</a></li>
<li><a href="#orga232311">5. Calculate \(\rho\)</a>
<ul>
<li><a href="#orgcca01a9">5.1. Create a matrix containing every possible refractive index (n+ik):</a></li>
<li><a href="#org943f47b">5.2. Calculate:</a></li>
<li><a href="#orgcc6c9ef">5.3. Compare calculated rho with given \(\Delta\) and \(\psi\):</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org2700a6f" class="outline-2">
<h2 id="org2700a6f"><span class="section-number-2">1</span> What is this?</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm coding a program to get the complex refractive index \(n = n * ik\) from the ellipsometric parameters \(\Delta\) and \(\Psi\) I got from a simulation.
</p>
</div>
</div>
<div id="outline-container-org4548a0d" class="outline-2">
<h2 id="org4548a0d"><span class="section-number-2">2</span> Imports:</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">import</span> numpy <span style="color: #F0DFAF; font-weight: bold;">as</span> np
<span style="color: #F0DFAF; font-weight: bold;">import</span> matplotlib
<span style="color: #F0DFAF; font-weight: bold;">from</span> matplotlib <span style="color: #F0DFAF; font-weight: bold;">import</span> pyplot
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2fe338" class="outline-2">
<h2 id="orge2fe338"><span class="section-number-2">3</span> Defining some variables:</h2>
<div class="outline-text-2" id="text-3">
<p>
Defining some variables for later use:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">CSVFILE</span> = <span style="color: #CC9393;">"head300nmSiO2.csv"</span>
<span style="color: #DFAF8F;">phi_i</span> = <span style="color: #BFEBBF;">70</span> * np.pi / <span style="color: #BFEBBF;">180</span>
<span style="color: #DFAF8F;">d_L</span> = <span style="color: #BFEBBF;">300</span>
<span style="color: #DFAF8F;">n_air</span> = <span style="color: #BFEBBF;">1</span>
<span style="color: #DFAF8F;">rerange</span> = <span style="color: #BFEBBF;">5</span>
<span style="color: #DFAF8F;">imrange</span> = <span style="color: #BFEBBF;">5</span>
<span style="color: #DFAF8F;">i</span> = <span style="color: #BFEBBF;">0</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0fff37" class="outline-2">
<h2 id="orgc0fff37"><span class="section-number-2">4</span> Read .csv-file:</h2>
<div class="outline-text-2" id="text-4">
<p>
Read the values into a two dimensional numpy array as [[lambda,Psi,Delta,n<sub>S,k</sub><sub>S</sub>],&#x2026;] (Skip columns 3 and 4)
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">csv</span> = np.loadtxt<span style="color: #DCDCCC;">(</span>CSVFILE, usecols=<span style="color: #BFEBBF;">(</span><span style="color: #BFEBBF;">0</span>,<span style="color: #BFEBBF;">1</span>,<span style="color: #BFEBBF;">2</span>,<span style="color: #BFEBBF;">5</span>,<span style="color: #BFEBBF;">6</span><span style="color: #BFEBBF;">)</span>,  delimiter=<span style="color: #CC9393;">","</span>, skiprows=<span style="color: #BFEBBF;">1</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>

<p>
:DEBUG:
The array looks like this:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span><span style="color: #DCDCCC;">(</span>csv<span style="color: #DCDCCC;">)</span>
</pre>
</div>
<pre class="example">
[[300.          55.2217535   84.37228319   2.6726       3.0375    ]
 [303.          50.11187439  93.3085011    2.7346       3.0381    ]
 [306.          46.35824553  98.43681392   2.7967       3.0368    ]
 [309.          43.50539341 101.18051798   2.8588       3.0334    ]
 [312.          41.29392865 102.19236832   2.9206       3.0279    ]
 [315.          39.48751217 101.93002      2.9822       3.0205    ]
 [318.          37.90308303 100.64846104   3.0435       3.0109    ]
 [321.          36.47640803  98.54577151   3.1042       2.9994    ]
 [324.          35.12615859  95.72242205   3.1644       2.9858    ]]

</pre>
</div>
</div>

<div id="outline-container-orga232311" class="outline-2">
<h2 id="orga232311"><span class="section-number-2">5</span> Calculate \(\rho\)</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgcca01a9" class="outline-3">
<h3 id="orgcca01a9"><span class="section-number-3">5.1</span> Create a matrix containing every possible refractive index (n+ik):</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">lsp_re</span> = np.linspace<span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">0</span>.<span style="color: #BFEBBF;">1</span>, rerange, <span style="color: #BFEBBF;">101</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DFAF8F;">lsp_im</span> = np.linspace<span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">0</span>.<span style="color: #BFEBBF;">1</span>, imrange, <span style="color: #BFEBBF;">101</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DFAF8F;">re</span>, <span style="color: #DFAF8F;">im</span> = np.meshgrid <span style="color: #DCDCCC;">(</span>lsp_re, lsp_im, copy=<span style="color: #BFEBBF;">False</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DFAF8F;">matrix</span> = <span style="color: #BFEBBF;">1j</span> * im + re
</pre>
</div>

<p>
This gives the following matrix:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">print</span><span style="color: #DCDCCC;">(</span>matrix<span style="color: #DCDCCC;">)</span>
</pre>
</div>

<pre class="example">
[[0.1  +0.1j   0.149+0.1j   0.198+0.1j   ... 4.902+0.1j   4.951+0.1j
  5.   +0.1j  ]
 [0.1  +0.149j 0.149+0.149j 0.198+0.149j ... 4.902+0.149j 4.951+0.149j
  5.   +0.149j]
 [0.1  +0.198j 0.149+0.198j 0.198+0.198j ... 4.902+0.198j 4.951+0.198j
  5.   +0.198j]
 ...
 [0.1  +4.902j 0.149+4.902j 0.198+4.902j ... 4.902+4.902j 4.951+4.902j
  5.   +4.902j]
 [0.1  +4.951j 0.149+4.951j 0.198+4.951j ... 4.902+4.951j 4.951+4.951j
  5.   +4.951j]
 [0.1  +5.j    0.149+5.j    0.198+5.j    ... 4.902+5.j    4.951+5.j
  5.   +5.j   ]]
</pre>
</div>
</div>
<div id="outline-container-org943f47b" class="outline-3">
<h3 id="org943f47b"><span class="section-number-3">5.2</span> Calculate:</h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #DFAF8F;">n_S</span> = <span style="color: #DCDCCC;">(</span>csv<span style="color: #BFEBBF;">[</span>i,<span style="color: #BFEBBF;">3</span><span style="color: #BFEBBF;">]</span> + <span style="color: #BFEBBF;">1j</span>* csv<span style="color: #BFEBBF;">[</span>i,<span style="color: #BFEBBF;">4</span><span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span>
<span style="color: #DFAF8F;">lambda_vac</span> = csv<span style="color: #DCDCCC;">[</span>i,<span style="color: #BFEBBF;">0</span><span style="color: #DCDCCC;">]</span>
<span style="color: #F0DFAF; font-weight: bold;">for</span> n_L <span style="color: #F0DFAF; font-weight: bold;">in</span> matrix.flat:
      <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Snell's Law:</span>
      <span style="color: #DFAF8F;">phi_L</span> = np.arcsin<span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span>np.sin<span style="color: #D0BF8F;">(</span>phi_i<span style="color: #D0BF8F;">)</span>*n_air<span style="color: #BFEBBF;">)</span>/ n_L<span style="color: #DCDCCC;">)</span>
      <span style="color: #DFAF8F;">phi_S</span> = np.arcsin<span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">(</span>np.sin<span style="color: #D0BF8F;">(</span>phi_L<span style="color: #D0BF8F;">)</span>*n_L<span style="color: #BFEBBF;">)</span>/ n_S<span style="color: #DCDCCC;">)</span>
      <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Fresnel equations:</span>
      <span style="color: #5F7F5F;">#</span>
      <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">air/layer:</span>
      <span style="color: #DFAF8F;">rs_al</span> = <span style="color: #DCDCCC;">(</span>n_air * np.cos<span style="color: #BFEBBF;">(</span>phi_i<span style="color: #BFEBBF;">)</span> - n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> / <span style="color: #DCDCCC;">(</span>n_air * np.cos<span style="color: #BFEBBF;">(</span>phi_i<span style="color: #BFEBBF;">)</span> + n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
      <span style="color: #DFAF8F;">rp_al</span> = <span style="color: #DCDCCC;">(</span>n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_i<span style="color: #BFEBBF;">)</span> - n_air * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> / <span style="color: #DCDCCC;">(</span>n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_i<span style="color: #BFEBBF;">)</span> + n_air * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
      <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">layer/substrate:</span>
      <span style="color: #DFAF8F;">rs_ls</span> = <span style="color: #DCDCCC;">(</span>n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span> - n_S * np.cos<span style="color: #BFEBBF;">(</span>phi_S<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> / <span style="color: #DCDCCC;">(</span>n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span> + n_S * np.cos<span style="color: #BFEBBF;">(</span>phi_S<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
      <span style="color: #DFAF8F;">rp_ls</span> = <span style="color: #DCDCCC;">(</span>n_S * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span> - n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_S<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> / <span style="color: #DCDCCC;">(</span>n_S * np.cos<span style="color: #BFEBBF;">(</span>phi_L<span style="color: #BFEBBF;">)</span> + n_L * np.cos<span style="color: #BFEBBF;">(</span>phi_S<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>
      <span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Fujiwara:</span>
      <span style="color: #DFAF8F;">beta</span> = <span style="color: #BFEBBF;">2</span> * np.pi * d_L * n_L * np.cos<span style="color: #DCDCCC;">(</span>phi_L<span style="color: #DCDCCC;">)</span> / lambda_vac
      <span style="color: #DFAF8F;">rp_L</span> = <span style="color: #DCDCCC;">(</span>rp_al + rp_ls * np.exp<span style="color: #BFEBBF;">(</span>-<span style="color: #BFEBBF;">2</span>*<span style="color: #BFEBBF;">1j</span>*beta<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> / <span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">1</span> + rp_al * rp_ls * np.exp<span style="color: #BFEBBF;">(</span>-<span style="color: #BFEBBF;">2</span> * <span style="color: #BFEBBF;">1j</span> * beta<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> 
      <span style="color: #DFAF8F;">rs_L</span> = <span style="color: #DCDCCC;">(</span>rs_al + rs_ls * np.exp<span style="color: #BFEBBF;">(</span>-<span style="color: #BFEBBF;">2</span>*<span style="color: #BFEBBF;">1j</span>*beta<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span> / <span style="color: #DCDCCC;">(</span> <span style="color: #BFEBBF;">1</span> + rs_al * rs_ls * np.exp<span style="color: #BFEBBF;">(</span>-<span style="color: #BFEBBF;">2</span> * <span style="color: #BFEBBF;">1j</span> * beta<span style="color: #BFEBBF;">)</span><span style="color: #DCDCCC;">)</span>   
      <span style="color: #DFAF8F;">rho</span> = rp_L / rs_L
      <span style="color: #DFAF8F;">output</span> = <span style="color: #DCDCCC;">[]</span>
      output.append<span style="color: #DCDCCC;">(</span><span style="color: #BFEBBF;">[</span>n_L, rho<span style="color: #BFEBBF;">]</span><span style="color: #DCDCCC;">)</span>
</pre>
</div>


<pre class="example">
for n_L =  (5+5j)
at lambda =  300.0
phi_L (0.09369049752311029-0.0942436309601521j)
phi_S (0.1516718935900151-0.1754940397472108j)
rs_al (-0.9322788656900732-0.06447800755339925j)
rp_al (0.47076999129408226+0.32915273622391117j)
rs_ls (0.2706645644366405-0.037805743704596925j)
rp_ls (-0.27413124901624036+0.021323198111731292j)
beta (31.139752412112067+31.69455000949363j)
rp_L (1.426723122645158-0.9975355870956931j)
rs_L (-1.067534044700266+0.07383248803644696j)
rho (-1.3944229215529675+0.8379890813445299j)
output [[(5+5j), (-1.3944229215529675+0.8379890813445299j)]]
</pre>
</div>
</div>

<div id="outline-container-orgcc6c9ef" class="outline-3">
<h3 id="orgcc6c9ef"><span class="section-number-3">5.3</span> Compare calculated rho with given \(\Delta\) and \(\psi\):</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Nikolai Weidt</p>
<p class="date">Created: 2018-10-04 Do 19:38</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
